swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
/**************************************************************************//**
 * @file      hal_crypto.c
 * @brief     This CRYPTO secure and non-secure HAL API functions.
 * @version   V1.00
 * @date      2021-07-22
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License. *
 *
 ******************************************************************************/

//#include <string.h>
#include <stdint.h>

#include "platform_conf.h"
#include "cmsis.h"
#include "rtl8735b_crypto.h"
#include "rtl8735b_crypto_ctrl.h"
#include "rtl8735b_crypto_type.h"
#include "hal.h"
#include "memory.h"
#include "hal_crypto.h"

// TODO: modification for 8710C: IP HW changed(few function are disabled)
#if CONFIG_CRYPTO_EN

/**
 * @addtogroup hs_hal_crypto CRYPTO
 * @{
 */

/**
 * Define Crypto HAL APIs for one thread access.
 * If users want to access Crypto HAL APIs in multi-threads,
 * then need to build a critical section mechanism in Application layer.
 */
#define CRYPTO_THREAD_MODE 0
#define MAX_KEY_NUMBER     5
#define MAX_KEY_LENGTH     32

#if CRYPTO_THREAD_MODE
#include "cmsis_os.h"
#endif

volatile int crypto_done;
volatile int crc_done;

//#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE==1)
#if !defined(CONFIG_BUILD_NONSECURE)

hal_crypto_adapter_t g_rtl_cryptoEngine_s;
extern hal_crypto_func_stubs_t hal_crypto_stubs_s;
#define HAL_CRYPTO_ADAPTER      (g_rtl_cryptoEngine_s)
#define HAL_CRYPTO_FUNC_STUBS   (hal_crypto_stubs_s)


//hal_crypto_adapter_t g_rtl_cryptoEngine_ns;
//extern hal_crypto_func_stubs_t hal_crypto_stubs_ns;
//#define HAL_CRYPTO_ADAPTER      (g_rtl_cryptoEngine_ns)
//#define HAL_CRYPTO_FUNC_STUBS   (hal_crypto_stubs_ns)
#else
hal_crypto_adapter_t g_rtl_cryptoEngine_ns;
extern hal_crypto_func_stubs_t hal_crypto_stubs_ns;
#define HAL_CRYPTO_ADAPTER      (g_rtl_cryptoEngine_ns)
#define HAL_CRYPTO_FUNC_STUBS   (hal_crypto_stubs_ns)
#endif

/*
 * 32bytes-aligned buffer that store mix mode hash padding initial values.
 */
const uint8_t mix_mode_hash_padding[64] __attribute__((aligned(32))) = {
	0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

/*
 * 32bytes-aligned buffer that store mix mode hash padding values.
 */
volatile uint8_t hash_padding[96] __attribute__((aligned(32))) = {0x0}; //Actual usage maximum size is (120 - 56)+ 8 = 72 bytes

/*
 * 32bytes-aligned buffer that store mix mode encrypt padding values.
 */
volatile uint8_t enc_padding[32] __attribute__((aligned(32))) = {0x0};

//
void hal_crypto_irq_enable(hal_crypto_adapter_t *pcrypto_adapter, void *handler);
void hal_crypto_irq_disable(hal_crypto_adapter_t *pcrypto_adapter);

/** @} */ /* End of group hs_hal_crypto */

//
#if CRYPTO_THREAD_MODE

#define CRYPTO_TIMEOUT 1000

osMutexDef(crypto_mutex);
static osMutexId crypto_mutex_id;
static int critical_init(void)
{
	crypto_mutex_id = osMutexCreate(osMutex(crypto_mutex));
	if (crypto_mutex_id == NULL) {
		rtl_printf("%s : mutex id is NULL \r\n", __func__);
		return -1;
	}

	return SUCCESS;
}

static int critical_enter(void)
{
	osStatus status;

	if (crypto_mutex_id == NULL) {
		rtl_printf("%s : mutex id is NULL \r\n", __func__);
		return -1;
	}

	status = osMutexWait(crypto_mutex_id, CRYPTO_TIMEOUT);
	if (status != osOK) {
		rtl_printf("hal_crypto: %s : mutex wait failed, status=0x%x \r\n", __func__, status);
		return -1;
	}
	return SUCCESS;
}


static int critical_leave(void)
{
	osStatus status;

	if (crypto_mutex_id == NULL) {
		rtl_printf("%s : mutex id is NULL \r\n", __func__);
		return -1;
	}

	status = osMutexRelease(crypto_mutex_id);
	if (status != osOK) {
		rtl_printf("%s : mutex release failed, status=0x%x \r\n", __func__, status);
		return -1;
	}

	return SUCCESS;
}

static int critical_deinit(void)
{
	osStatus status;

	if (crypto_mutex_id == NULL) {
		rtl_printf("%s : mutex id is NULL \r\n", __func__);
		return -1;
	}

	if (crypto_mutex_id != NULL) {
		status = osMutexDelete(osMutex(crypto_mutex));

		if (status != osOK) {
			rtl_printf("%s : mutex delete fail \r\n", __func__);
			return -1;
		}
	}
	return SUCCESS;
}

#endif


#if CRYPTO_THREAD_MODE

#define MAX_THREADS 8
#define CRYPTO_SIGNAL 0x0100

static osThreadId g_thread_id[MAX_THREADS];
static int g_thread_list_head = 0;
static int g_thread_list_tail = 0;
static osThreadId g_crc_thread_id;


static osThreadId thread_list_get(void)
{
	osThreadId id;

	if (g_thread_list_head == g_thread_list_tail) {
		return NULL;
	}

	id = g_thread_id[g_thread_list_head];
	g_thread_list_head = (g_thread_list_head + 1) % MAX_THREADS;

	return id;
}

static int thread_list_add(osThreadId id)
{
	int next = (g_thread_list_tail + 1) % MAX_THREADS;

	if (next == g_thread_list_head) {
		rtl_printf("%s : FULL \r\n", __func__);
		return -1;
	}
	g_thread_id[g_thread_list_tail] = id;
	g_thread_list_tail = next;

	return 0;
}

#endif

/**
 * @addtogroup hs_hal_crypto CRYPTO
 * @{
 */
#if !defined(CONFIG_BUILD_NONSECURE)

#undef CRYPTO_MODULE
#define CRYPTO_MODULE (CRYPTO_S_MODULE)

#undef CRYPTO_REG_BASE
#define CRYPTO_REG_BASE (CRYPTO_S_BASE)

#else

#undef CRYPTO_MODULE
#define CRYPTO_MODULE (CRYPTO_NS_MODULE)

