swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
#undef CRYPTO_REG_BASE
#define CRYPTO_REG_BASE (CRYPTO_NS_BASE)


#endif


#define ACCESS_EXTERNAL_MEM                 1

#define INITMAP_REG_HAL_CALL                (1 << 0)
#define INITMAP_DEREG_HAL_CALL              (~INITMAP_REG_HAL_CALL) // (0 << 0)

#define INITMAP_REG_S_PLATFORM              (1 << 1)
#define INITMAP_REG_NS_PLATFORM             (1 << 2)
#define INITMAP_DEREG_S_PLATFORM            (~INITMAP_REG_S_PLATFORM)  // 0x5
#define INITMAP_DEREG_NS_PLATFORM           (~INITMAP_REG_NS_PLATFORM) // 0x3

#define INITMAP_S_REG                       0x2
#define INITMAP_NS_REG                      0x4


#define HASH_PADDING_PUT_UINT32_LE(n,b,i)                       \
{                                                               \
    (b)[(i)    ] = (unsigned char) ( ( (n)       ) & 0xFF );   \
    (b)[(i) + 1] = (unsigned char) ( ( (n) >>  8 ) & 0xFF );   \
    (b)[(i) + 2] = (unsigned char) ( ( (n) >> 16 ) & 0xFF );   \
    (b)[(i) + 3] = (unsigned char) ( ( (n) >> 24 ) & 0xFF );   \
}

#define HASH_PADDING_PUT_UINT32_BE(n,b,i)               \
{                                                       \
    (b)[(i)    ] = (unsigned char) ( (n) >> 24 );       \
    (b)[(i) + 1] = (unsigned char) ( (n) >> 16 );       \
    (b)[(i) + 2] = (unsigned char) ( (n) >>  8 );       \
    (b)[(i) + 3] = (unsigned char) ( (n)       );       \
}

/**
 *  @brief To notify a thread that crypto engine or CRC engine has already calculated a result.
 *  @param[in]  ok_int_cnt  counter value of crypto engine calculated a result interrupt
 *  @param[in]  isCrc       flag value of CRC engine calculated a result interrupt
 *  @return     void
 */
void g_crypto_handler(int ok_int_cnt, int isCrc)
{
	//rtl_printf("%s : ok_int_cnt = %d , isCrc=%d\r\n",
	//      __FUNCTION__, ok_int_cnt, isCrc);

#if CRYPTO_THREAD_MODE
	osThreadId id;
	int i, loops;

	loops = ok_int_cnt;

	for (i = 0; i < loops; i++) {
		id = thread_list_get();
		if (id != NULL) {
			osSignalSet(id, CRYPTO_SIGNAL);
		} else {
			rtl_printf("%s: list get NULL \r\n", __func__);
		}
	}
#else
	if (ok_int_cnt > 0) {
		crypto_done = 1;
	}
#endif

	if (isCrc) {
#if CRYPTO_THREAD_MODE
		osSignalSet(g_crc_thread_id, CRYPTO_SIGNAL);
#else
		crc_done = 1;
#endif
	}
}

/**
 *  @brief To initialize the notified flag of crypto engine.
 *  @param[in]  pIE1  Crypto adapter object
 *  @return     value == 0     success
 *  @return     value < 0      fail
 */
int g_crypto_pre_exec(void *pIE1)
{
	(void)(pIE1);
#if CRYPTO_THREAD_MODE
	{
		int32_t signal;
		osThreadId curID = osThreadGetId();
		int ret1;

		signal = osSignalClear(curID, CRYPTO_SIGNAL);
		if (signal != osOK) {
			rtl_printf("osSignalClear failed, signal= 0x%x \r\n", signal);
			return -1;
		}
		ret1 = thread_list_add(curID);
		if (ret1 != 0) {
			rtl_printf("%s : thread_list_add FULL \r\n", __func__);
			return -1;
		}
	}
#else
	crypto_done = 0;
#endif

	return SUCCESS;
}

/**
 *  @brief To wait to be notified that the crypto engine calculates a result. If crypto calculating result
 *         interrupt arrives, it will trigger interrupt service routine which notifies this information to a thread.
 *  @param[in]  pIE1  Crypto adapter object
 *  @return     value == 0     success
 *  @return     value < 0      fail
 */
int g_crypto_wait_done(void *pIE1)
{
	uint32_t loopWait;
	volatile uint32_t ips_err;
	volatile uint32_t ips_10_status;
	hal_crypto_adapter_t *pcrypto_adapter = (hal_crypto_adapter_t *)pIE1;
	(void)(pcrypto_adapter);
	loopWait = 1000000; /* hope long enough */
#if CRYPTO_THREAD_MODE
	{
		osEvent evt;

		evt = osSignalWait(CRYPTO_SIGNAL, 100); // wait for 100 ms

		if ((evt.status != osOK) && (evt.status != osEventSignal)) {
			rtl_printf("osSignalWait failed, evt.status = 0x%x \r\n", evt.status);
			return -1;
		}
	}
#else
	if (pcrypto_adapter->isIntMode) {
		//while ( crypto_done == 0 );
		// TODO: can add some Delay / and loops limitation
		while (crypto_done == 0) {
			loopWait--;
			if (loopWait == 0) {
				ips_10_status = (CRYPTO_MODULE->ipscsr_reset_isr_conf_reg);
				ips_err = (CRYPTO_MODULE->ipscsr_err_stats_reg);
				DBG_CRYPTO_ERR("Crypto interrupt doesn't arrive.\r\n");
				DBG_CRYPTO_ERR("Wait Timeout ips status = 0x%08x, ips err = 0x%08x\r\n", ips_10_status, ips_err);
				return FAIL; /* error occurs */
			}
		}
	}
#endif
	// if not interrupt mode, suggest to use default one
	return SUCCESS;
}

#if defined(CONFIG_BUILD_SECURE)
/**
 *  @brief      Enable/Disable the clock of IPsec in RAM code.
 *  @param[in]  en  set the clock of IPsec state: 1=Enable, 0=Disable
 *  @return     void
 */
void hal_crypto_engine_init_platform_en_ctrl(const int en)
{

	hal_crypto_adapter_t *pcrypto_adapter = &g_rtl_cryptoEngine_s;
	if (!((pcrypto_adapter->initmap) & INITMAP_S_REG)) {
		hal_crypto_stubs_s.hal_crypto_engine_platform_en_ctrl(en);
	}
	if (en) {
		(pcrypto_adapter->initmap) |= INITMAP_REG_NS_PLATFORM; //register non_s init
	} else {
		(pcrypto_adapter->initmap) &= INITMAP_DEREG_NS_PLATFORM; //deregister non_s init
	}
}

SECTION_NS_ENTRY_FUNC void NS_ENTRY hal_crypto_engine_init_platform_nsc(const int en)
{
	hal_crypto_engine_init_platform_en_ctrl(en);
}
#endif

#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE==1)
#if defined(ENABLE_SECCALL_PATCH)
/*Need to be defined in different object file from the caller, otherwise -Wl,-wrap may fail*/
extern void hal_crypto_engine_init_platform(void *adapter, const int en);
#else
void hal_crypto_engine_init_platform(void *adapter, const int en)
{
	hal_crypto_engine_init_platform_nsc(en);
}
#endif
#elif (!(defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE==1))) || (defined(CONFIG_BUILD_BOOT) && (CONFIG_BUILD_BOOT==1))
void hal_crypto_engine_init_platform(void *adapter, const int en)
{
	phal_crypto_adapter_t pcrypto_adapter = (phal_crypto_adapter_t)adapter;
	if (!((pcrypto_adapter->initmap) & INITMAP_NS_REG)) {
		hal_crypto_stubs_s.hal_crypto_engine_platform_en_ctrl(en);
	}
	if (en) {
		(pcrypto_adapter->initmap) |= INITMAP_REG_S_PLATFORM;   //register s init
	} else {
		(pcrypto_adapter->initmap) &= INITMAP_DEREG_S_PLATFORM; //deregister s init
	}
}
#endif


//
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
#define EXRAM_PSRAM_START_ADDR              (0x60000000)
#define EXRAM_PSRAM_END_ADDR                (0x60400000)

