swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
typedef struct crypto_buf_addr_s {
	const uint8_t *buf_addr;
} crypto_buf_addr_t, *pcrypto_buf_addr_t;

volatile uint8_t psram_check = 0;

void exram_psram_addr_check(phal_crypto_adapter_t pcrypto_adapter, pcrypto_buf_addr_t crypto_buf_list, const uint8_t buf_total_size)
{

	uint8_t i, match_check = 0;
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	for (i = 0; i < buf_total_size; i++) {
		if (((u32)(crypto_buf_list[i].buf_addr) >= EXRAM_PSRAM_START_ADDR) &&
			((u32)(crypto_buf_list[i].buf_addr) < EXRAM_PSRAM_END_ADDR)) {
			match_check++;
		}
	}
	if (match_check > 0) {
		// set DMA single command for slow memory acessing(PSRAM/FLash one ID mode)
		pcrypto->ipscsr_swap_burst_reg_b.dma_burst_length = 1;
		psram_check = 1;
	} else {
		// set DMA Burst length for internal memory acessing(internal SRAM/ DTCM)
		pcrypto->ipscsr_swap_burst_reg_b.dma_burst_length = 16;
	}
}
#endif

int hal_crypto_engine_chk_init(void)
{
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;
	if (pcrypto_adapter->isInit == 1) {
		return TRUE;
	} else {
		return FALSE;
	}
}

int hal_crypto_engine_init(void)
{
	int ret = SUCCESS;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit) {
		DBG_CRYPTO_WARN("Crypto engine has initialized!\r\n");
		return SUCCESS;
	}
	//For enable/disable __dbg_mem_dump()
	pcrypto_adapter->isMemDump = 0;

	pcrypto_adapter->pre_exec_func = g_crypto_pre_exec;
	pcrypto_adapter->wait_done_func = g_crypto_wait_done;

	//DBG_CRYPTO_INFO("hal_crypto_adapter->initmap = 0x%x\r\n",pcrypto_adapter->initmap);
	hal_crypto_engine_init_platform(pcrypto_adapter, 1);
	(pcrypto_adapter->initmap) |= INITMAP_REG_HAL_CALL;   //Notify rom code, init is from hal
	//DBG_CRYPTO_INFO("hal_crypto_adapter->initmap = 0x%x\r\n",pcrypto_adapter->initmap);

	ret = (HAL_CRYPTO_FUNC_STUBS.hal_crypto_engine_init)(pcrypto_adapter);
	if (ret != SUCCESS) {
		return ret;
	}
#if ACCESS_EXTERNAL_MEM
	pcrypto_adapter->arch_clean_dcache_by_size = (void (*)(uint32_t, int32_t))hal_cache_stubs.dcache_clean_by_addr;
	pcrypto_adapter->arch_invalidate_dcache_by_size = (void (*)(uint32_t, int32_t))hal_cache_stubs.dcache_invalidate_by_addr;
#else
	pcrypto_adapter->arch_clean_dcache_by_size = NULL;
	pcrypto_adapter->arch_invalidate_dcache_by_size = NULL;
#endif

#if CRYPTO_THREAD_MODE
	critical_init();
#endif
	hal_crypto_irq_enable(pcrypto_adapter, (void *)g_crypto_handler);
	return ret;
}

int hal_crypto_engine_deinit(void)
{
	int ret = SUCCESS;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit == 0) {
		DBG_CRYPTO_WARN("Crypto engine doesn't initialize!\r\n");
		return SUCCESS;
	}

	pcrypto_adapter->pre_exec_func = NULL;
	pcrypto_adapter->wait_done_func = NULL;
	pcrypto_adapter->arch_clean_dcache_by_size = NULL;
	pcrypto_adapter->arch_invalidate_dcache_by_size = NULL;
	hal_crypto_irq_disable(pcrypto_adapter);
	ret = (HAL_CRYPTO_FUNC_STUBS.hal_crypto_engine_deinit)(pcrypto_adapter);
	if (ret != SUCCESS) {
		return ret;
	}
	//DBG_CRYPTO_INFO("hal_crypto_adapter->initmap = 0x%x\r\n",pcrypto_adapter->initmap);
	hal_crypto_engine_init_platform(pcrypto_adapter, 0);
	(pcrypto_adapter->initmap) &= INITMAP_DEREG_HAL_CALL;  //deinit the notify flag
	//DBG_CRYPTO_INFO("hal_crypto_adapter->initmap = 0x%x\r\n",pcrypto_adapter->initmap);

#if CRYPTO_THREAD_MODE
	critical_deinit();
#endif
	return ret;
}


//
// IRQ
//
/**
 *  @brief The CRYPTO interrupt service routine function pointer type.
 */
typedef void (*crypto_isr_t)(int, int);

//
crypto_isr_t irq_handle;

/**
 *  @brief The CRYPTO interrupt handler. It processes interrupt events which are crypto engine calculated a result or
 *         CRC engine calculated a result.
 *  @return     void
 */
void crypto_handler(void)
{
	crypto_isr_t handler = (crypto_isr_t)irq_handle;

	//uint32_t ips_10_status, ips_err;
	volatile uint32_t ok_int_cnt;
	//volatile uint32_t val;

	ok_int_cnt = (CRYPTO_MODULE->ipscsr_reset_isr_conf_reg_b.ok_intr_cnt);
	if (ok_int_cnt > 0) {
		(CRYPTO_MODULE->ipscsr_reset_isr_conf_reg_b.clear_ok_intr_num) = ok_int_cnt;
		(CRYPTO_MODULE->ipscsr_reset_isr_conf_reg_b.cmd_ok) = 1;
	}
	//val = (CRYPTO_MODULE->ipscsr_reset_isr_conf_reg).w;
	//ips_10_status = (CRYPTO_MODULE->ipscsr_reset_isr_conf_reg).w;
	//ips_err = (CRYPTO_MODULE->ipscsr_err_stats_reg).w;
	//if ( ips_err != 0 )
	//    rtl_printf("- ips status =0x%08x, ips err = 0x%08x\r\n", ips_10_status, ips_err);

	//rtl_printf("ok_int_cnt : %d \r\n", ok_int_cnt);

	// for CRC
	{
		int isCrc = 0;
//#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE==1)
#if !defined(CONFIG_BUILD_NONSECURE)
		volatile uint32_t val;
		//Only Non-secure support crc engine
		val = (CRYPTO_MODULE->crc_stat_reg_b.crc_ok);

		if (val) {
			(CRYPTO_MODULE->crc_stat_reg_b.crc_ok) = 1;
			isCrc = 1;
		}
#endif
		handler(ok_int_cnt, isCrc);
	}

	// To make sure the cmd_ok has been written
	__DSB();
}

/**
 *  @brief To register a interrupt handler for the crypto engine and initialize the related crypto interrupt settings.
 *  @param[in]  pcrypto_adapter   Crypto adapter object
 *  @param[in]  handler Interrupt service routine function
 *  @return     void
 */
void hal_crypto_irq_enable(hal_crypto_adapter_t *pcrypto_adapter, void *handler)
{
	irq_handle = (crypto_isr_t)handler;

#if !defined(CONFIG_BUILD_NONSECURE)
	hal_irq_set_vector(SCrypto_IRQn, (uint32_t)crypto_handler);
	hal_irq_clear_pending(SCrypto_IRQn);
	hal_irq_set_priority(SCrypto_IRQn, SCrypto_IRQPri);

	(CRYPTO_MODULE->ipscsr_reset_isr_conf_reg_b.intr_mode) = 1;
	(CRYPTO_MODULE->ipscsr_int_mask_reg_b.cmd_ok_m) = 0;
	hal_irq_enable(SCrypto_IRQn);
#else
	hal_irq_set_vector(Crypto_IRQn, (uint32_t)crypto_handler);
	hal_irq_clear_pending(Crypto_IRQn);
	hal_irq_set_priority(Crypto_IRQn, Crypto_IRQPri);

	(CRYPTO_MODULE->ipscsr_reset_isr_conf_reg_b.intr_mode) = 1;
	(CRYPTO_MODULE->ipscsr_int_mask_reg_b.cmd_ok_m) = 0;
	hal_irq_enable(Crypto_IRQn);
#endif


	pcrypto_adapter->isIntMode = 1;
}

/**
 *  @brief To un-register a interrupt handler for the crypto engine and enable interrupt mask,
 *         then inactive interrupt mode state.
 *  @param[in]  pcrypto_adapter  Crypto adapter object
 *  @return     void
 */
void hal_crypto_irq_disable(hal_crypto_adapter_t *pcrypto_adapter)
{
	if (pcrypto_adapter->isIntMode) {
		(CRYPTO_MODULE->ipscsr_int_mask_reg_b.cmd_ok_m) = 1;

#if !defined(CONFIG_BUILD_NONSECURE)
		hal_irq_disable(SCrypto_IRQn);
		hal_irq_set_vector(SCrypto_IRQn, (uint32_t)NULL);
#else
		hal_irq_disable(Crypto_IRQn);
		hal_irq_set_vector(Crypto_IRQn, (uint32_t)NULL);

#endif
		pcrypto_adapter->isIntMode = 0;
	}
}

