swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
int hal_crypto_sha2_256_process(
	IN const u8 *message, IN const u32 msglen,
	OUT u8 *pDigest)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		if (msglen > 0) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		} else {
			memcpy(pDigest, sha2_256_null_msg_result, 32);
			return SUCCESS;
		}
	}
	if (msglen == 0) {
		memcpy(pDigest, sha2_256_null_msg_result, 32);
		return SUCCESS;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	crypto_buf_addr_t crypto_buf_list[2] = {
		{.buf_addr = message},
		{.buf_addr = pDigest}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 2);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_process(pcrypto_adapter, AUTH_TYPE_SHA2_256_ALL, message, msglen, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_sha2_256_update(IN const u8 *message, IN const u32 msglen)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[1] = {
			{.buf_addr = message}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_update(pcrypto_adapter, AUTH_TYPE_SHA2_256_ALL, message, msglen);
	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
	}
	return ret;
}

int hal_crypto_sha2_256_final(OUT u8 *pDigest)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[1] = {
			{.buf_addr = pDigest}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_final(pcrypto_adapter, AUTH_TYPE_SHA2_256_ALL, pDigest);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

// SHA2-384
int hal_crypto_sha2_384(IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
//    if (message == NULL) {
//        if (msglen > 0) {
//            return _ERRNO_CRYPTO_NULL_POINTER;
//        } else {
//            memcpy(pDigest, sha2_224_null_msg_result, 28);
//            return SUCCESS;
//        }
//    }
//    if (msglen == 0) {
//        memcpy(pDigest, sha2_224_null_msg_result, 28);
//        return SUCCESS;
//    }
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[2] = {
		{.buf_addr = message},
		{.buf_addr = pDigest}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 2);
#endif
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth(pcrypto_adapter, AUTH_TYPE_SHA2_384_ALL, message, msglen, NULL, 0, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_sha2_384_init(void)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
#endif
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_init(pcrypto_adapter, AUTH_TYPE_SHA2_384_ALL, NULL, 0);
	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
	}
	return ret;
}

int hal_crypto_sha2_384_process(
	IN const u8 *message, IN const u32 msglen,
	OUT u8 *pDigest)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
//    if (message == NULL) {
//        if (msglen > 0) {
//            return _ERRNO_CRYPTO_NULL_POINTER;
//        } else {
//            memcpy(pDigest, sha2_224_null_msg_result, 28);
//            return SUCCESS;
//        }
//    }
//    if (msglen == 0) {
//        memcpy(pDigest, sha2_224_null_msg_result, 28);
//        return SUCCESS;
//    }
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	crypto_buf_addr_t crypto_buf_list[2] = {
		{.buf_addr = message},
		{.buf_addr = pDigest}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 2);
#endif
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_process(pcrypto_adapter, AUTH_TYPE_SHA2_384_ALL, message, msglen, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_sha2_384_update(IN const u8 *message, IN const u32 msglen)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[1] = {
			{.buf_addr = message}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_update(pcrypto_adapter, AUTH_TYPE_SHA2_384_ALL, message, msglen);
	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
	}
	return ret;
}

int hal_crypto_sha2_384_final(OUT u8 *pDigest)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[1] = {
			{.buf_addr = pDigest}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
	}
#endif

