swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_final(pcrypto_adapter, AUTH_TYPE_HMAC_SHA1, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}


// HMAC-sha2
// -- 224
int hal_crypto_hmac_sha2_224(IN const u8 *message, IN const u32 msglen,
							 IN const u8 *key, IN const u32 keylen, OUT u8 *pDigest)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (keylen <= 0) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (keylen > CRYPTO_AUTH_PADDING) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[3] = {
		{.buf_addr = message},
		{.buf_addr = key},
		{.buf_addr = pDigest}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 3);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth(pcrypto_adapter, AUTH_TYPE_HMAC_SHA2_224_ALL, message, msglen, key, keylen, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_hmac_sha2_224_init(IN const u8 *key, IN const u32 keylen)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (keylen <= 0) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (keylen > CRYPTO_AUTH_PADDING) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[1] = {
		{.buf_addr = key}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_init(pcrypto_adapter, AUTH_TYPE_HMAC_SHA2_224_ALL, key, keylen);
	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
	}
	return ret;
}

int hal_crypto_hmac_sha2_224_process(IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}

#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[2] = {
			{.buf_addr = message},
			{.buf_addr = pDigest}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 2);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_process(pcrypto_adapter, AUTH_TYPE_HMAC_SHA2_224_ALL, message, msglen, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_hmac_sha2_224_update(IN const u8 *message, IN const u32 msglen)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}

#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[1] = {
			{.buf_addr = message}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_update(pcrypto_adapter, AUTH_TYPE_HMAC_SHA2_224_ALL, message, msglen);
	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
	}
	return ret;
}

int hal_crypto_hmac_sha2_224_final(OUT u8 *pDigest)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[1] = {
			{.buf_addr = pDigest}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth_final(pcrypto_adapter, AUTH_TYPE_HMAC_SHA2_224_ALL, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

// -- 256
int hal_crypto_hmac_sha2_256(IN const u8 *message, IN const u32 msglen,
							 IN const u8 *key, IN const u32 keylen, OUT u8 *pDigest)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (keylen <= 0) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (keylen > CRYPTO_AUTH_PADDING) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[3] = {
		{.buf_addr = message},
		{.buf_addr = key},
		{.buf_addr = pDigest}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 3);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_auth(pcrypto_adapter, AUTH_TYPE_HMAC_SHA2_256_ALL, message, msglen, key, keylen, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

