swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
//AES GHASH

int hal_crypto_aes_ghash(
	IN const u8 *message, IN const u32 msglen,
	IN const u8 *key, IN const u32 keylen,
	OUT u8 *pDigest)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (keylen != CRYPTO_AES128_KEY_LENGTH) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[3] = {
		{.buf_addr = message},
		{.buf_addr = key},
		{.buf_addr = pDigest}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 3);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_AES_GHASH, key, keylen);
	if (ret != SUCCESS) {
		return ret;
	}
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_decrypt(pcrypto_adapter, CIPHER_TYPE_AES_GHASH, message, msglen,
			NULL, 0, NULL, 0, NULL, pDigest);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_aes_ghash_init(IN const u8 *key, IN const u32 keylen)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (keylen != CRYPTO_AES128_KEY_LENGTH) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[1] = {
		{.buf_addr = key}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_AES_GHASH, key, keylen);

	return ret;
}

int hal_crypto_aes_ghash_process(IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[2] = {
			{.buf_addr = message},
			{.buf_addr = pDigest}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 2);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_decrypt(pcrypto_adapter, CIPHER_TYPE_AES_GHASH, message, msglen,
			NULL, 0, NULL, 0, NULL, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

//AES GMAC

int hal_crypto_aes_gmac(
	IN const u8 *message, IN const u32 msglen,
	IN const u8 *key, IN const u32 keylen,
	IN const u8 *iv,
	IN const u8 *aad, IN const u32 aadlen, OUT u8 *pTag)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((keylen != CRYPTO_AES128_KEY_LENGTH) && (keylen != CRYPTO_AES192_KEY_LENGTH) &&
		(keylen != CRYPTO_AES256_KEY_LENGTH)) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pTag == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[5] = {
		{.buf_addr = message},
		{.buf_addr = key},
		{.buf_addr = iv},
		{.buf_addr = aad},
		{.buf_addr = pTag}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 5);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_AES_GMAC, key, keylen);
	if (ret != SUCCESS) {
		return ret;
	}
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_decrypt(pcrypto_adapter, CIPHER_TYPE_AES_GMAC, message, msglen,
			iv, 0, aad, aadlen, NULL, pTag);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_aes_gmac_init(IN const u8 *key, IN const u32 keylen)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((keylen != CRYPTO_AES128_KEY_LENGTH) && (keylen != CRYPTO_AES192_KEY_LENGTH) &&
		(keylen != CRYPTO_AES256_KEY_LENGTH)) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[1] = {
		{.buf_addr = key}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_AES_GMAC, key, keylen);

	return ret;
}

int hal_crypto_aes_gmac_process(
	IN const u8 *message, IN const u32 msglen,
	IN const u8 *iv, IN const u8 *aad, IN const u32 aadlen, OUT u8 *pTag)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pTag == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[4] = {
			{.buf_addr = message},
			{.buf_addr = iv},
			{.buf_addr = aad},
			{.buf_addr = pTag}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 4);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_decrypt(pcrypto_adapter, CIPHER_TYPE_AES_GMAC, message, msglen,
			iv, 0, aad, aadlen, NULL, pTag);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

//AES-GCTR

int hal_crypto_aes_gctr_init(IN const u8 *key, IN const u32 keylen)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((keylen != CRYPTO_AES128_KEY_LENGTH) && (keylen != CRYPTO_AES192_KEY_LENGTH) &&
		(keylen != CRYPTO_AES256_KEY_LENGTH)) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[1] = {
		{.buf_addr = key}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 1);
#endif

	ret =  HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_AES_GCTR, key, keylen);
	return ret;
}

int hal_crypto_aes_gctr_encrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv, OUT u8 *pResult)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_AES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_AES_MSGLEN_NOT_16Byte_Aligned;
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[3] = {
			{.buf_addr = message},
			{.buf_addr = iv},
			{.buf_addr = pResult}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 3);
	}
#endif

