swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_DES_ECB, key, keylen);

	return ret;
}

int hal_crypto_des_ecb_encrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 ivlen,
	OUT u8 *pResult)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	iv = NULL;
	if (ivlen != 0) {
		return _ERRNO_CRYPTO_IV_OutRange;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_DES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_DES_MSGLEN_NOT_8Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_encrypt(pcrypto_adapter, CIPHER_TYPE_DES_ECB, message, msglen, iv, ivlen,
			NULL, 0, pResult, NULL);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_des_ecb_decrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 ivlen,
	OUT u8 *pResult)
{
	int ret;

	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	iv = NULL;
	if (ivlen != 0) {
		return _ERRNO_CRYPTO_IV_OutRange;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_DES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_DES_MSGLEN_NOT_8Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_decrypt(pcrypto_adapter, CIPHER_TYPE_DES_ECB, message, msglen, iv, ivlen,
			NULL, 0, pResult, NULL);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

// 3DES-CBC
int hal_crypto_3des_cbc_init(IN const u8 *key, IN const u32 keylen)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (keylen != CRYPTO_3DES_KEY_LENGTH) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_3DES_CBC, key, keylen);

	return ret;
}

int hal_crypto_3des_cbc_encrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 ivlen,
	OUT u8 *pResult)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (ivlen != CRYPTO_DES_IV_LENGTH) {
		return _ERRNO_CRYPTO_IV_OutRange;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_DES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_DES_MSGLEN_NOT_8Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_encrypt(pcrypto_adapter, CIPHER_TYPE_3DES_CBC, message, msglen, iv, ivlen,
			NULL, 0, pResult, NULL);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_3des_cbc_decrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 ivlen,
	OUT u8 *pResult)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (ivlen != CRYPTO_DES_IV_LENGTH) {
		return _ERRNO_CRYPTO_IV_OutRange;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_DES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_DES_MSGLEN_NOT_8Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_decrypt(pcrypto_adapter, CIPHER_TYPE_3DES_CBC, message, msglen, iv, ivlen,
			NULL, 0, pResult, NULL);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

// 3DES-ECB

int hal_crypto_3des_ecb_init(IN const u8 *key, IN const u32 keylen)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (keylen != CRYPTO_3DES_KEY_LENGTH) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_3DES_ECB, key, keylen);

	return ret;
}

int hal_crypto_3des_ecb_encrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 ivlen,
	OUT u8 *pResult)
{
	int ret;

	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	iv = NULL;
	if (ivlen != 0) {
		return _ERRNO_CRYPTO_IV_OutRange;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_DES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_DES_MSGLEN_NOT_8Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_encrypt(pcrypto_adapter, CIPHER_TYPE_3DES_ECB, message, msglen, iv, ivlen,
			NULL, 0, pResult, NULL);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_3des_ecb_decrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 ivlen,
	OUT u8 *pResult)
{
	int ret;

	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	iv = NULL;
	if (ivlen != 0) {
		return _ERRNO_CRYPTO_IV_OutRange;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_DES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_DES_MSGLEN_NOT_8Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_cipher_decrypt(pcrypto_adapter, CIPHER_TYPE_3DES_ECB, message, msglen, iv, ivlen,
			NULL, 0, pResult, NULL);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}


uint32_t hal_crypto_mix_mode_calculate_hash_padding(hal_crypto_adapter_t *pcrypto_adapter,
		IN const u32 auth_type, IN const u32 msglen, IN const u32 aadlen)
{
	uint64_t hash_total_len;
	uint32_t low, high, last, padn, hash_padlen;
	uint8_t hash_msglen[8] = {0x0};

