swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
	/*
	 * Calculate hash padding values and size
	 */
	memset((void *)hash_padding, 0x0, sizeof(hash_padding));
	if (pcrypto_adapter->isHMAC) {
		hash_total_len = (msglen + aadlen) + 64;
		//DBG_CRYPTO_INFO("hmac add 64bytes key pad\r\n");
	} else {
		hash_total_len = (msglen + aadlen);
	}

	/* Note:
	 * AND 0x3F -> Know the last data size which need to be calculated.
	 * Use the last data size to calculate how many bytes of padding.
	 * Because there're reserved 8 bytes to represent total msglen in bits, so (64 - 8) = 56 or (64*2 - 8) = 120
	 */
	last = ((msglen + aadlen) & 0x3F);
	padn = (last < 56) ? (56 - last) : (120 - last);
	memcpy((void *)hash_padding, (void *)mix_mode_hash_padding, padn);

	/* Total hash msglen use 8bytes to represent!!!seperate low 4 bytes, high 4 bytes!!
	 * Note:
	 * Because when store value to low, hash_total_len[31:0] need to left shift 3 bits(means 1byte to 8bits)
	 * so if there are values in b'31:29, the 32bits low value can't store over 32 bits, so leave b'31:29 of
	 * hash_total_len[31:0] to high value.
	 */
	high = ((hash_total_len & (0xFFFFFFFF)) >> 29)
		   | (((hash_total_len >> 32) & (0xFFFFFFFF)) <<  3);
	low  = ((hash_total_len & (0xFFFFFFFF)) <<  3);
	if ((AUTH_TYPE_MD5 == auth_type) || (AUTH_TYPE_HMAC_MD5 == auth_type)) {
		HASH_PADDING_PUT_UINT32_LE(low,  hash_msglen, 0);
		HASH_PADDING_PUT_UINT32_LE(high, hash_msglen, 4);
	} else {
		HASH_PADDING_PUT_UINT32_BE(high, hash_msglen, 0);
		HASH_PADDING_PUT_UINT32_BE(low, hash_msglen, 4);
	}
	memcpy((void *)(hash_padding + padn), (void *)hash_msglen, 8);
	hash_padlen = (padn + 8);

	return hash_padlen;
}

uint32_t hal_crypto_mix_mode_calculate_enc_padding(hal_crypto_adapter_t *pcrypto_adapter,
		IN const u32 auth_type, IN const u32 msglen)
{
	uint32_t new_enc_last_data_size = 0, enc_padlen = 0, mac_len = 0;

	/*
	 * Calculate enc padding size & set values
	 */
	if ((AUTH_TYPE_MD5 == auth_type) || (AUTH_TYPE_HMAC_MD5 == auth_type)) {
		mac_len = CRYPTO_MD5_DIGEST_LENGTH;
	} else if ((AUTH_TYPE_SHA1 == auth_type) || (AUTH_TYPE_HMAC_SHA1 == auth_type)) {
		mac_len = CRYPTO_SHA1_DIGEST_LENGTH;
	} else if ((AUTH_TYPE_SHA2_224_ALL == auth_type) || (AUTH_TYPE_HMAC_SHA2_224_ALL == auth_type)) {
		mac_len = SHA2_224;
	} else if ((AUTH_TYPE_SHA2_256_ALL == auth_type) || (AUTH_TYPE_HMAC_SHA2_256_ALL == auth_type)) {
		mac_len = SHA2_256;
	}
	// AES block size is 16bytes
	// Even if (plaintext msglen + mac_len) is cipher aligned, it still needs to pad a pair data of cipher aligned
	// because of crypto engine degisn.
	new_enc_last_data_size = (msglen + mac_len) % 16;
	enc_padlen = (16 - new_enc_last_data_size) % 16;
	if (enc_padlen == 0) {
		enc_padlen = 16;
	}

	memset((void *)enc_padding, 0x0F, sizeof(enc_padding));

	return enc_padlen;
}

int hal_crypto_mix_mode_init(IN const u32 cipher_type, IN const u32 auth_type,
							 IN const u8 *cipher_key, IN const u32 cipher_keylen,
							 IN const u8 *auth_key, IN const u32 auth_keylen)
{
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	if (cipher_key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(cipher_key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	// Ameba_zii only support AES algorithm
	if ((cipher_keylen != CRYPTO_AES128_KEY_LENGTH) && (cipher_keylen != CRYPTO_AES192_KEY_LENGTH) &&
		(cipher_keylen != CRYPTO_AES256_KEY_LENGTH)) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (auth_keylen != 0) {
		if (auth_keylen > CRYPTO_AUTH_PADDING) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
		if (auth_key == NULL) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		}
		if ((u32)(auth_key) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
	}
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	psram_check = 0;
	crypto_buf_addr_t crypto_buf_list[2] = {
		{.buf_addr = cipher_key},
		{.buf_addr = auth_key}
	};
	exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 2);
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_mix_mode_init(pcrypto_adapter, cipher_type, auth_type, cipher_key, cipher_keylen,
			auth_key, auth_keylen);

	return ret;
}

int hal_crypto_mix_ssh_encrypt(IN const u32 cipher_type,
							   IN const u8 *message, IN const u32 msglen,
							   IN const u8 *iv, IN const u32 ivlen,
							   IN const u8 *aad, IN const u32 aadlen,
							   IN const u32 auth_type,
							   OUT u8 *pResult, OUT u8 *pTag)
{
	int ret;
	uint32_t hash_padlen = 0;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv != NULL) {
		if ((u32)(iv) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pTag == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_AES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_AES_MSGLEN_NOT_16Byte_Aligned;
	}
	hash_padlen = hal_crypto_mix_mode_calculate_hash_padding(pcrypto_adapter, auth_type, msglen, aadlen);

#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[5] = {
			{.buf_addr = message},
			{.buf_addr = iv},
			{.buf_addr = aad},
			{.buf_addr = pResult},
			{.buf_addr = pTag}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 5);
	}
#endif
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_mix_mode_process(pcrypto_adapter, CRYPTO_MIX_MODE_SSH_ENC,
			cipher_type, message, msglen, iv, ivlen,
			aad, aadlen, auth_type, (const u8 *)hash_padding, hash_padlen,
			NULL, 0, pResult, pTag);



#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_mix_ssh_decrypt(IN const u32 cipher_type,
							   IN const u8 *message, IN const u32 msglen,
							   IN const u8 *iv, IN const u32 ivlen,
							   IN const u8 *aad, IN const u32 aadlen,
							   IN const u32 auth_type,
							   OUT u8 *pResult, OUT u8 *pTag)
{
	int ret;
	uint32_t hash_padlen = 0;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv != NULL) {
		if ((u32)(iv) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pTag == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_AES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_AES_MSGLEN_NOT_16Byte_Aligned;
	}

	hash_padlen = hal_crypto_mix_mode_calculate_hash_padding(pcrypto_adapter, auth_type, msglen, aadlen);
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[5] = {
			{.buf_addr = message},
			{.buf_addr = iv},
			{.buf_addr = aad},
			{.buf_addr = pResult},
			{.buf_addr = pTag}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 5);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_mix_mode_process(pcrypto_adapter, CRYPTO_MIX_MODE_SSH_DEC,
			cipher_type, message, msglen, iv, ivlen,
			aad, aadlen, auth_type, (const u8 *)hash_padding, hash_padlen,
			NULL, 0, pResult, pTag);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

