swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
int hal_crypto_mix_esp_encrypt(IN const u32 cipher_type,
							   IN const u8 *message, IN const u32 msglen,
							   IN const u8 *iv, IN const u32 ivlen,
							   IN const u8 *aad, IN const u32 aadlen,
							   IN const u32 auth_type,
							   OUT u8 *pResult, OUT u8 *pTag)
{
	int ret;
	uint32_t hash_padlen = 0;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv != NULL) {
		if ((u32)(iv) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pTag == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_AES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_AES_MSGLEN_NOT_16Byte_Aligned;
	}

	hash_padlen = hal_crypto_mix_mode_calculate_hash_padding(pcrypto_adapter, auth_type, msglen, aadlen);
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[5] = {
			{.buf_addr = message},
			{.buf_addr = iv},
			{.buf_addr = aad},
			{.buf_addr = pResult},
			{.buf_addr = pTag}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 5);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_mix_mode_process(pcrypto_adapter, CRYPTO_MIX_MODE_ESP_ENC,
			cipher_type, message, msglen, iv, ivlen,
			aad, aadlen, auth_type, (const u8 *)hash_padding, hash_padlen,
			NULL, 0, pResult, pTag);



#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_mix_esp_decrypt(IN const u32 cipher_type,
							   IN const u8 *message, IN const u32 msglen,
							   IN const u8 *iv, IN const u32 ivlen,
							   IN const u8 *aad, IN const u32 aadlen,
							   IN const u32 auth_type,
							   OUT u8 *pResult, OUT u8 *pTag)
{
	int ret;
	uint32_t hash_padlen = 0;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv != NULL) {
		if ((u32)(iv) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pTag == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_AES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_AES_MSGLEN_NOT_16Byte_Aligned;
	}

	hash_padlen = hal_crypto_mix_mode_calculate_hash_padding(pcrypto_adapter, auth_type, msglen, aadlen);
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[5] = {
			{.buf_addr = message},
			{.buf_addr = iv},
			{.buf_addr = aad},
			{.buf_addr = pResult},
			{.buf_addr = pTag}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 5);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_mix_mode_process(pcrypto_adapter, CRYPTO_MIX_MODE_ESP_DEC,
			cipher_type, message, msglen, iv, ivlen,
			aad, aadlen, auth_type, (const u8 *)hash_padding, hash_padlen,
			NULL, 0, pResult, pTag);


#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_mix_ssl_tls_encrypt(IN const u32 cipher_type,
								   IN const u8 *message, IN const u32 msglen,
								   IN const u8 *iv, IN const u32 ivlen,
								   IN const u8 *aad, IN const u32 aadlen,
								   IN const u32 auth_type,
								   OUT u8 *pResult)
{
	int ret;
	u8 *pTag = NULL;
	uint32_t hash_padlen = 0, enc_padlen = 0;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv != NULL) {
		if ((u32)(iv) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_AES_IV_LENGTH) != 0) {
		return _ERRNO_CRYPTO_AES_MSGLEN_NOT_16Byte_Aligned;
	}

	hash_padlen = hal_crypto_mix_mode_calculate_hash_padding(pcrypto_adapter, auth_type, msglen, aadlen);

	enc_padlen  = hal_crypto_mix_mode_calculate_enc_padding(pcrypto_adapter, auth_type, msglen);
#if defined (CONFIG_EXRAM_PSRAM_EN) && (CONFIG_EXRAM_PSRAM_EN == 1)
	if (psram_check == 0) {
		crypto_buf_addr_t crypto_buf_list[4] = {
			{.buf_addr = message},
			{.buf_addr = iv},
			{.buf_addr = aad},
			{.buf_addr = pResult}
		};
		exram_psram_addr_check(pcrypto_adapter, &crypto_buf_list[0], 4);
	}
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_mix_mode_process(pcrypto_adapter, CRYPTO_MIX_MODE_SSL_TLS_ENC,
			cipher_type, message, msglen, iv, ivlen,
			aad, aadlen, auth_type, (const u8 *)hash_padding, hash_padlen,
			(const u8 *)enc_padding, enc_padlen, pResult, pTag);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}




// poly1305
int hal_crypto_poly1305(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *key,
	OUT u8 *pDigest)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_poly1305(pcrypto_adapter, message, msglen, key, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

