swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
int hal_crypto_poly1305_init(IN const u8 *key)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_poly1305_init(pcrypto_adapter, key);
	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
	}
	return ret;
}

int hal_crypto_poly1305_process(
	IN const u8 *message, IN const u32 msglen,
	OUT u8 *pDigest)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_poly1305_process(pcrypto_adapter, message, msglen, pDigest);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_chacha_init(IN const u8 *key)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_chacha_init(pcrypto_adapter, key);
	return ret;
}

int hal_crypto_chacha_encrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 count,
	OUT u8 *pResult)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_CHACHA_MSG_ALIGN) != 0) {
		return _ERRNO_CRYPTO_CHACHA_MSGLEN_NOT_16Byte_Aligned;
	}

	ret =  HAL_CRYPTO_FUNC_STUBS.hal_crypto_chacha_encrypt(pcrypto_adapter, message, msglen, iv, count, pResult);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_chacha_decrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 count,
	OUT u8 *pResult)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_CHACHA_MSG_ALIGN) != 0) {
		return _ERRNO_CRYPTO_CHACHA_MSGLEN_NOT_16Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_chacha_decrypt(pcrypto_adapter, message, msglen, iv, count, pResult);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_chacha_poly1305_init(IN const u8 *key)
{
	int ret;
#if CRYPTO_THREAD_MODE
	critical_enter();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_chacha_poly1305_init(pcrypto_adapter, key);
	return ret;
}

int hal_crypto_chacha_poly1305_encrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,
	IN const u8 *aad,   IN const u32 aadlen,
	OUT u8 *pResult, OUT u8 *pTag)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pTag == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_CHACHA_MSG_ALIGN) != 0) {
		return _ERRNO_CRYPTO_CHACHA_MSGLEN_NOT_16Byte_Aligned;
	}

	ret =  HAL_CRYPTO_FUNC_STUBS.hal_crypto_chacha_poly1305_encrypt(pcrypto_adapter, message, msglen, iv, aad, aadlen, pResult, pTag);
#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

int hal_crypto_chacha_poly1305_decrypt(
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,
	IN const u8 *aad,   IN const u32 aadlen,
	OUT u8 *pResult, OUT u8 *pTag)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (iv == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((u32)(aad) & 0x1F) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (aadlen > CRYPTO_MAX_AAD_LENGTH) {
		return _ERRNO_CRYPTO_AAD_OutRange;
	}
	if (pTag == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pResult == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRYPTO_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	if ((msglen % CRYPTO_CHACHA_MSG_ALIGN) != 0) {
		return _ERRNO_CRYPTO_CHACHA_MSGLEN_NOT_16Byte_Aligned;
	}

