swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_chacha_poly1305_decrypt(pcrypto_adapter, message, msglen, iv, aad, aadlen, pResult, pTag);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
int hal_crypto_key_storage_writekey(uint8_t *key, uint8_t keylen, uint8_t key_num)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}

	//ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_key_storage_writekey(pcrypto_adapter, key, keylen, key_num);
	return ret;
}

int hal_crypto_key_storage_writeback(uint8_t key_num, bool _IsWriteback)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	//ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_key_storage_writeback(pcrypto_adapter, key_num, _IsWriteback);
	return ret;
}

int hal_crypto_key_storage_securekey(uint8_t key_num, bool _UseKey)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	//ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_key_storage_securekey(pcrypto_adapter, key_num, _UseKey);
	return ret;
}
#else

int hal_crypto_key_storage_securekey(uint8_t key_num, bool _UseKey)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_key_storage_securekey(pcrypto_adapter, key_num, _UseKey);
	return ret;
}

int hal_crypto_key_storage_writeback(uint8_t key_num, bool _IsWriteback)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_key_storage_writeback(pcrypto_adapter, key_num, _IsWriteback);
	return ret;
}

int hal_crypto_key_storage_writekey(uint8_t *key, uint8_t keylen, uint8_t key_num)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_key_storage_writekey(pcrypto_adapter, key, keylen, key_num);
	return ret;
}

int hal_crypto_key_storage_lock(uint8_t key_num, bool _Lock)
{
	int ret;
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_key_storage_lock(pcrypto_adapter, key_num);
	return ret;
}
#endif

//#if CRC_ROM_CTRL_RDY

//#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE==1)
#if !defined(CONFIG_BUILD_NONSECURE)
//#if 1


//crc
int hal_crypto_crc32_cmd(IN const u8 *message, IN const u32 msglen, OUT u32 *pCrc)
{
#if CRYPTO_THREAD_MODE
	osThreadId curID = osThreadGetId();
#endif

	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	int ret = SUCCESS;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pCrc == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRC_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}

#if CRYPTO_THREAD_MODE
	critical_enter();
	g_crc_thread_id = curID;
#else
	crc_done = 0;
#endif

	//DBG_CRYPTO_INFO("start crc32 HW\r\n");
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc32_cmd(pcrypto_adapter, message, msglen);

	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
		return ret;
	}

	/*
	 * Doesn't need to wait crc_done or signal, because of using polling way
	 ***/

	*pCrc = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc_get_result(pcrypto_adapter);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}


int hal_crypto_crc_setting(int order, unsigned long polynom,
						   unsigned long crcinit, unsigned long crcxor, int refin, int refout)
{
#if 0
	osThreadId curID = osThreadGetId();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	int ret = SUCCESS;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

#if 0
	critical_enter();
	g_crc_thread_id = curID;
#else
	crc_done = 0;
#endif

	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc_setting(pcrypto_adapter, order, polynom, crcinit, crcxor, refin, refout);



	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
	}
	return ret;
}

//#if 1

int hal_crypto_crc_cmd(IN const u8 *message, IN const u32 msglen, OUT u32 *pCrc)
{
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;
	int ret = SUCCESS;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pCrc == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRC_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}

	(void)(pcrypto_adapter);
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc_cmd(pcrypto_adapter, message, msglen);

	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
		return ret;
	}
	/*
	 * Doesn't need to wait crc_done or signal, because of using polling way
	 ***/

	*pCrc = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc_get_result(pcrypto_adapter);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif

	return ret;
}

//#else

int hal_crypto_crc_dma(IN const u8 *message, IN const u32 msglen, OUT u32 *pCrc)
{
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;
	int ret = SUCCESS;
	uint32_t loopWait;
	volatile uint32_t crcstat_err;

