swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_crypto.c
	loopWait = 10000;/* hope long enough */

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pCrc == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRC_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	(void)(pcrypto_adapter);
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	ret = hal_rtl_crypto_crc_dma_patch(pcrypto_adapter, message, msglen);
#else
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc_dma(pcrypto_adapter, message, msglen);
#endif

	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
		return ret;
	}

	//DBG_CRYPTO_INFO("wait\r\n");
#if CRYPTO_THREAD_MODE
	{
		osEvent evt;

		//DBG_CRYPTO_INFO("wait for signal , curID: 0x%x\r\n", curID);
		evt = osSignalWait(CRYPTO_SIGNAL, osWaitForever); // wait for 100 ms

		if ((evt.status != osOK) && (evt.status != osEventSignal)) {
			DBG_CRYPTO_ERR("osSignalWait failed, evt.status = 0x%x \r\n", evt.status);
			return -1;
		}
	}
#else
	if (pcrypto_adapter->isIntMode) {
		//while ( crc_done == 0 );
		//TODO: can add some Delay / and loops limitation
		while (crc_done == 0) {
			loopWait--;
			if (loopWait == 0) {
				crcstat_err = (CRYPTO_MODULE->crc_stat_reg);
				DBG_CRYPTO_ERR("CRC interrupt doesn't arrive.Wait Timeout crc status =0x%08x\r\n", crcstat_err);
				return FAIL; /* error occurs */
			}
		}
	}
#endif

	*pCrc = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc_get_result(pcrypto_adapter);

#if CRYPTO_THREAD_MODE
	critical_leave();
#endif

	return ret;
}

int hal_crypto_crc32_dma(IN const u8 *message, IN const u32 msglen, OUT u32 *pCrc)
{
#if CRYPTO_THREAD_MODE
	osThreadId curID = osThreadGetId();
#endif
	hal_crypto_adapter_t *pcrypto_adapter = &HAL_CRYPTO_ADAPTER;

	int ret = SUCCESS;
	uint32_t loopWait;
	volatile uint32_t crcstat_err;

	loopWait = 10000;/* hope long enough */

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pCrc == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return 0;
	}
	if (msglen > CRC_MAX_MSG_LENGTH) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}

#if CRYPTO_THREAD_MODE
	critical_enter();
	g_crc_thread_id = curID;
#else
	crc_done = 0;
#endif

	//DBG_CRYPTO_INFO("start crc32 HW\r\n");
	ret = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc32_dma(pcrypto_adapter, message, msglen);

	if (ret != SUCCESS) {
#if CRYPTO_THREAD_MODE
		critical_leave();
#endif
		return ret;
	}

	//DBG_CRYPTO_INFO("wait\r\n");
#if CRYPTO_THREAD_MODE
	{
		osEvent evt;

		//DBG_CRYPTO_INFO("wait for signal , curID: 0x%x\r\n", curID);
		evt = osSignalWait(CRYPTO_SIGNAL, osWaitForever); // wait for 100 ms

		if ((evt.status != osOK) && (evt.status != osEventSignal)) {
			DBG_CRYPTO_ERR("osSignalWait failed, evt.status = 0x%x \r\n", evt.status);
			return -1;
		}
	}
#else
	if (pcrypto_adapter->isIntMode) {
		//while ( crc_done == 0 );
		//TODO: can add some Delay / and loops limitation
		while (crc_done == 0) {
			loopWait--;
			if (loopWait == 0) {
				crcstat_err = (CRYPTO_MODULE->crc_stat_reg);
				DBG_CRYPTO_ERR("CRC interrupt doesn't arrive.Wait Timeout crc status =0x%08x\r\n", crcstat_err);
				return FAIL; /* error occurs */
			}
		}
	}
#endif

	*pCrc = HAL_CRYPTO_FUNC_STUBS.hal_crypto_crc_get_result(pcrypto_adapter);


#if CRYPTO_THREAD_MODE
	critical_leave();
#endif
	return ret;
}


int hal_crypto_crc_division(int order, unsigned long polynom,
							unsigned long crcinit, unsigned long crcxor, int refin, int refout,
							IN uint32_t *message, IN uint32_t msglen, OUT uint32_t *Result)
{
	uint32_t *nextmessage;
	uint32_t *pAsicDigest;
	u32 loop, remain, proceeded_CRC_init = 0;
	int process_msglen = 8192;
	int i = 0;
	int ret;
	//process_msglen = 32;
	ret = SUCCESS;
	loop = msglen / process_msglen;
	if (msglen % process_msglen) {
		loop++;
	}
	remain = msglen;
	nextmessage = message;

#if 1
	uint8_t _asic_digest[1][64];
	memset(&_asic_digest[0][0], 0, sizeof(_asic_digest[0]));
	pAsicDigest = (uint32_t *)&_asic_digest[0][32];
#endif

	for (i = 0; i < loop; i++) {
		if (i == 0) {
			DBG_CRYPTO_INFO("First\r\n");
			ret = hal_crypto_crc_setting(order, polynom, crcinit, 0, refin, 0);
			if (ret != SUCCESS) {
				DBG_CRYPTO_ERR("Error %x\r\n", ret);
				return ret;
			}

			ret = hal_crypto_crc_dma((uint8_t *)message, process_msglen, pAsicDigest);
			if (ret != SUCCESS) {
				DBG_CRYPTO_ERR("Error %x\r\n", ret);
				return ret;
			}
			remain = remain - process_msglen;
		} else {
			if (remain <= process_msglen) {
				DBG_CRYPTO_INFO("Final\r\n");
				ret = hal_crypto_crc_setting(order, polynom, proceeded_CRC_init, crcxor, refin, refout);
				if (ret != SUCCESS) {
					DBG_CRYPTO_ERR("Error %x\r\n", ret);
					return ret;
				}

				ret = hal_crypto_crc_dma((uint8_t *)nextmessage, remain, Result);
				if (ret != SUCCESS) {
					DBG_CRYPTO_ERR("Error %x\r\n", ret);
					return ret;
				}
			} else {
				DBG_CRYPTO_INFO("Update\r\n");
				ret = hal_crypto_crc_setting(order, polynom, proceeded_CRC_init, 0, refin, 0);
				if (ret != SUCCESS) {
					DBG_CRYPTO_ERR("Error %x\r\n", ret);
					return ret;
				}

				ret = hal_crypto_crc_dma((uint8_t *)nextmessage, process_msglen, pAsicDigest);
				if (ret != SUCCESS) {
					DBG_CRYPTO_ERR("Error %x\r\n", ret);
					return ret;
				}
				remain = remain - process_msglen;
			}
		}
		nextmessage = nextmessage + process_msglen / 4;
		//__crypto_mem_dump(nextmessage, process_msglen, "nextmessage:");
		proceeded_CRC_init = (
								 (*((uint8_t *)pAsicDigest))       |
								 (*((uint8_t *)pAsicDigest + 1) << 8)   |
								 (*((uint8_t *)pAsicDigest + 2) << 16)  |
								 (*((uint8_t *)pAsicDigest + 3) << 24));
	}

	return ret;
}


#endif

//#else
//
//int hal_crypto_crc_cmd(IN const u8 *message, IN const u32 msglen, OUT u32 *pCrc, hal_crypto_adapter_t *pcrypto_adapter)
//{
//    //hal_crypto_adapter_t *pcrypto_adapter = &g_rtl_cryptoEngine_ns;
//    //hal_crypto_adapter_t *pcrypto_adapter = &g_rtl_cryptoEngine_s;
//    int ret = SUCCESS;
//
//    if (pcrypto_adapter->isInit != _TRUE) {
//        return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
//    }
//    if (pCrc == NULL) {
//        return _ERRNO_CRYPTO_NULL_POINTER;
//    }
//    if (message == NULL) {
//        return _ERRNO_CRYPTO_NULL_POINTER;
//    }
//    if (msglen == 0) {
//        return 0;
//    }
//    if (msglen > CRC_MAX_MSG_LENGTH) {
//        return _ERRNO_CRYPTO_MSG_OutRange;
//    }
//
//    (void)(pcrypto_adapter);
//    //ret = hal_crypto_stubs_ns.hal_crypto_crc_cmd(pcrypto_adapter, message, msglen);
//    ret = hal_rom_crypto_crc_cmd(pcrypto_adapter, message, msglen);
//
//    if (ret != SUCCESS) {
//#if CRYPTO_THREAD_MODE
//        critical_leave();
//#endif
//        return ret;
//    }
//    /*
//     * Doesn't need to wait crc_done or signal, because of using polling way
//     ***/
//
//    //*pCrc = hal_crypto_stubs_ns.hal_crypto_crc_get_result(pcrypto_adapter);
//    //*pCrc = hal_crypto_stubs_ns.hal_crypto_crc_get_result();
//
//    *pCrc = hal_rom_crypto_crc_get_result(pcrypto_adapter);
//
//#if CRYPTO_THREAD_MODE
//    critical_leave();
//#endif
//
//    return ret;
//}
//
//int hal_crypto_crc_dma(IN const u8 *message, IN const u32 msglen, OUT u32 *pCrc, hal_crypto_adapter_t *pcrypto_adapter)
//{
//    //hal_crypto_adapter_t *pcrypto_adapter = &g_rtl_cryptoEngine_ns;
//
//    int ret = SUCCESS;
//    uint32_t loopWait;
//    volatile uint32_t crcstat_err;
//
//    loopWait = 10000;/* hope long enough */
//
//    if (pcrypto_adapter->isInit != _TRUE) {
//        return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
//    }
//    if (pCrc == NULL) {
//        return _ERRNO_CRYPTO_NULL_POINTER;
//    }
//    if (message == NULL) {
//        return _ERRNO_CRYPTO_NULL_POINTER;
//    }
//    if (msglen == 0) {
//        return 0;
//    }
//    if (msglen > CRC_MAX_MSG_LENGTH) {
//        return _ERRNO_CRYPTO_MSG_OutRange;
//    }
//
//    (void)(pcrypto_adapter);
//    //ret = hal_crypto_stubs_ns.hal_crypto_crc_dma(pcrypto_adapter, message, msglen);
//    ret = hal_rom_crypto_crc_dma(pcrypto_adapter, message, msglen);
//
//    if (ret != SUCCESS) {
//#if 0 //CRYPTO_THREAD_MODE
//        critical_leave();
//#endif
//        return ret;
//    }
//
//    //DBG_CRYPTO_INFO("wait\r\n");
//#if 0 //CRYPTO_THREAD_MODE
//    {
//        osEvent evt;
//
//        //DBG_CRYPTO_INFO("wait for signal , curID: 0x%x\r\n", curID);
//        evt = osSignalWait(CRYPTO_SIGNAL, osWaitForever); // wait for 100 ms
//
//        if ((evt.status != osOK) && (evt.status != osEventSignal)) {
//            DBG_CRYPTO_ERR("osSignalWait failed, evt.status = 0x%x \r\n", evt.status);
//            return -1;
//        }
//    }
//#else
//    if (pcrypto_adapter->isIntMode) {
//        //while ( crc_done == 0 );
//        //TODO: can add some Delay / and loops limitation
//        while (crc_done == 0) {
//            loopWait--;
//            if (loopWait == 0) {
//                crcstat_err = (CRYPTO_MODULE->crc_stat_reg);
//                DBG_CRYPTO_ERR("CRC interrupt doesn't arrive.Wait Timeout crc status =0x%08x\r\n", crcstat_err);
//                return FAIL; /* error occurs */
//            }
//        }
//    }
//#endif
//
//    //*pCrc = hal_crypto_stubs_ns.hal_crypto_crc_get_result(pcrypto_adapter);
//    //*pCrc = hal_crypto_stubs_ns.hal_crypto_crc_get_result();
//    *pCrc = hal_rom_crypto_crc_get_result(pcrypto_adapter);
//
//#if CRYPTO_THREAD_MODE
//    critical_leave();
//#endif
//
//    return ret;
//}
//#endif

//#endif


#endif  // end of "#if CONFIG_CRYPTO_EN"
